In [2]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'key1': ['a', 'a', 'b', 'b', 'a'], 'key2' : ['one', 'two', 'one', 'two', 'one'], 'data1': np.random.randn(5), 'data2': np.random.randn(5)})

In [3]:
df

      data1     data2 key1 key2
0 -1.074431  1.802192    a  one
1 -1.727796  0.556484    a  two
2  0.759637 -1.193181    b  one
3 -1.255660 -0.301579    b  two
4 -0.874309 -0.418629    a  one

In [4]:
# compute the mean of data1 column by key1

In [5]:
grouped = df['data1'].groupby(df['key1'])

In [6]:
grouped

In [7]:
grouped.mean()

key1
a   -1.225512
b   -0.248012
Name: data1, dtype: float64

In [8]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [9]:
means

key1  key2
a     one    -0.974370
      two    -1.727796
b     one     0.759637
      two    -1.255660
Name: data1, dtype: float64

In [10]:
means.unstack()

key2       one       two
key1
a    -0.974370 -1.727796
b     0.759637 -1.255660

In [11]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', "Ohio"])
years = np.array([2005, 2005, 2006, 2005, 2006])

In [12]:
df['data1'].groupby([states, years]).mean()

California  2005   -1.727796
            2006    0.759637
Ohio        2005   -1.165046
            2006   -0.874309
Name: data1, dtype: float64

In [14]:
df.groupby('key1').mean()

         data1     data2
key1
a    -1.225512  0.646683
b    -0.248012 -0.747380

In [16]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.974370  0.691782
     two  -1.727796  0.556484
b    one   0.759637 -1.193181
     two  -1.255660 -0.301579

In [20]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [21]:
list(df.groupby('key1'))

[('a',       data1     data2 key1 key2
  0 -1.074431  1.802192    a  one
  1 -1.727796  0.556484    a  two
  4 -0.874309 -0.418629    a  one), ('b',       data1     data2 key1 key2
  2  0.759637 -1.193181    b  one
  3 -1.255660 -0.301579    b  two)]

In [23]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0 -1.074431  1.802192    a  one
1 -1.727796  0.556484    a  two
4 -0.874309 -0.418629    a  one
b
      data1     data2 key1 key2
2  0.759637 -1.193181    b  one
3 -1.255660 -0.301579    b  two

In [24]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
      data1     data2 key1 key2
0 -1.074431  1.802192    a  one
4 -0.874309 -0.418629    a  one
('a', 'two')
      data1     data2 key1 key2
1 -1.727796  0.556484    a  two
('b', 'one')
      data1     data2 key1 key2
2  0.759637 -1.193181    b  one
('b', 'two')
     data1     data2 key1 key2
3 -1.25566 -0.301579    b  two

In [25]:
pieces = dict(list(df.groupby('key1')))

In [32]:
pieces['b']

      data1     data2 key1 key2
2  0.759637 -1.193181    b  one
3 -1.255660 -0.301579    b  two

In [34]:
pieces['a']

      data1     data2 key1 key2
0 -1.074431  1.802192    a  one
1 -1.727796  0.556484    a  two
4 -0.874309 -0.418629    a  one

In [35]:
df

      data1     data2 key1 key2
0 -1.074431  1.802192    a  one
1 -1.727796  0.556484    a  two
2  0.759637 -1.193181    b  one
3 -1.255660 -0.301579    b  two
4 -0.874309 -0.418629    a  one

In [36]:
grouped = df.groupby(df.dtypes, axis = 1)

In [37]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -1.074431  1.802192
1 -1.727796  0.556484
2  0.759637 -1.193181
3 -1.255660 -0.301579
4 -0.874309 -0.418629
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [38]:
df

      data1     data2 key1 key2
0 -1.074431  1.802192    a  one
1 -1.727796  0.556484    a  two
2  0.759637 -1.193181    b  one
3 -1.255660 -0.301579    b  two
4 -0.874309 -0.418629    a  one

In [46]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.691782
     two   0.556484
b    one  -1.193181
     two  -0.301579

In [60]:
# the previous statement is the same as
df[['data2']].groupby([df['key1'], df['key2']]).mean()

              data2
key1 key2
a    one   0.691782
     two   0.556484
b    one  -1.193181
     two  -0.301579

In [61]:
people = pd.DataFrame(np.random.randn(5,5), columns = ['a', 'b', 'c', 'd', 'e'], index = ['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [62]:
people

               a         b         c         d         e
Joe    -0.443359  0.004632 -1.904160 -1.697465  0.400718
Steve  -0.303574  0.667378  1.122032  0.174947  2.773013
Wes     0.899259  0.032663  0.522003  0.022810  1.226236
Jim     0.304231  0.900604 -0.402474  0.020818 -0.502620
Travis -0.049183  0.220749 -1.349963  1.422146 -0.482377

In [64]:
people.iloc[2, [1,2]] = np.nan

In [65]:
people

               a         b         c         d         e
Joe    -0.443359  0.004632 -1.904160 -1.697465  0.400718
Steve  -0.303574  0.667378  1.122032  0.174947  2.773013
Wes     0.899259       NaN       NaN  0.022810  1.226236
Jim     0.304231  0.900604 -0.402474  0.020818 -0.502620
Travis -0.049183  0.220749 -1.349963  1.422146 -0.482377

In [66]:
# group people DataFrame by column
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [68]:
by_column = people.groupby(mapping, axis=1)

In [69]:
by_column.sum()

            blue       red
Joe    -3.601626 -0.038009
Steve   1.296979  3.136817
Wes     0.022810  2.125496
Jim    -0.381656  0.702215
Travis  0.072184 -0.310812

In [70]:
map_series = pd.Series(mapping)

In [71]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [72]:
people.groupby(mapping, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [74]:
# group people DataFrame by the length of the names
people.groupby(len).sum()

          a         b         c         d         e
3  0.760131  0.905236 -2.306634 -1.653837  1.124334
5 -0.303574  0.667378  1.122032  0.174947  2.773013
6 -0.049183  0.220749 -1.349963  1.422146 -0.482377

In [78]:
# group people DataFrame by a specific list and lemgth of names
key_list = ['one', 'one', 'one', 'two', 'two']
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.443359  0.004632 -1.904160 -1.697465  0.400718
  two  0.304231  0.900604 -0.402474  0.020818 -0.502620
5 one -0.303574  0.667378  1.122032  0.174947  2.773013
6 two -0.049183  0.220749 -1.349963  1.422146 -0.482377

In [80]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'], [1,3,5,1,3]], names = ['cty', 'tenor'])

In [81]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [82]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.533215  0.796488  0.480864 -0.723992  0.484230
1     -1.704990 -0.224217 -1.766101  0.306178  1.610061
2     -0.318749 -0.341850 -0.666385  1.621856  0.137529
3      1.443683 -1.562876 -0.285425  1.724705 -0.700617

In [84]:
# group DataFram by column
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [85]:
hier_df.groupby(level='tenor', axis = 1).count()

tenor  1  3  5
0      2  2  1
1      2  2  1
2      2  2  1
3      2  2  1

In [86]:
df

      data1     data2 key1 key2
0 -1.074431  1.802192    a  one
1 -1.727796  0.556484    a  two
2  0.759637 -1.193181    b  one
3 -1.255660 -0.301579    b  two
4 -0.874309 -0.418629    a  one

In [87]:
grouped = df.groupby('key1')

In [94]:
# getting the 90 percent quantile of data1 by key1
grouped['data1'].quantile(0.9)

key1
a   -0.914333
b    0.558107
Name: data1, dtype: float64

In [95]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [96]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     0.853487  2.220821
b     2.015297  0.891602

In [100]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -1.225512  0.446351 -1.727796 -1.401114 -1.074431 -0.974370
b      2.0 -0.248012  1.425030 -1.255660 -0.751836 -0.248012  0.255812

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a    -0.874309   3.0  0.646683  1.113155 -0.418629  0.068928  0.556484
b     0.759637   2.0 -0.747380  0.630458 -1.193181 -0.970281 -0.747380


           75%       max
key1
a     1.179338  1.802192
b    -0.524480 -0.301579

In [101]:
# Column-Wise and Multiple Function Application

In [103]:
# find the tips percentage of tips between different days with smoker table and non-smoker table
tips = pd.read_csv('tips.csv')

In [104]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [105]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [106]:
grouped_tips = tips.groupby(['day', 'smoker'])

In [107]:
grouped_pct = grouped_tips['tip_pct']

In [141]:
tips_mean = grouped_pct.agg('mean')

In [142]:
tips_mean.max()

0.18725031625235425

In [143]:
# find the maximum average tip's conditions
for key, value in dict(tips_mean).items():
    if value == tips_mean.max():
        print(key)

('Sun', 'Yes')

In [144]:
# find the minimum average tip's comditions
for key, value in dict(tips_mean).items():
    if value == tips_mean.min():
        print(key)

('Sat', 'Yes')

In [147]:
tips_mean

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64